## Production: cloudfront
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                 NAME                  |
|--------|---------------------------------------|
| add    | `aws_route53_record.cds_website_en_A` |
|        | `aws_route53_record.cds_website_fr_A` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.cds_website_en_A will be created
  + resource "aws_route53_record" "cds_website_en_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "digital.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z03609363QXPGHL6RVNUP"

      + alias {
          + evaluate_target_health = false
          + name                   = "d1521nfitmrfqw.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

  # aws_route53_record.cds_website_fr_A will be created
  + resource "aws_route53_record" "cds_website_fr_A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "numerique.cdssandbox.xyz"
      + type            = "A"
      + zone_id         = "Z0368027JUUPG658ZY05"

      + alias {
          + evaluate_target_health = false
          + name                   = "d1drqcaw0n1gh3.cloudfront.net"
          + zone_id                = "Z2FDTNDATAQYW2"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.log_bucket.aws_s3_bucket.this,
  on .terraform/modules/log_bucket/S3_log_bucket/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
